Repository: ystk/debian-ocfs2-tools
Catalog: debian/po/*.po
Languages: pl

source: Would you like to start an OCFS2 cluster (O2CB) at boot time?
pl: Uruchamiać klaster OCFS2 (O2CB) podczas rozruchu systemu?

source: Name of the cluster to start at boot time:
pl: Nazwa klastra do uruchamiania w czasie rozruchu:

source: O2CB heartbeat threshold:
pl: Odstęp heartbeat O2CB:

source: The O2CB heartbeat threshold sets up the maximum time in seconds that a node awaits for an I/O operation. After it, the node "fences" itself, and you will probably see a crash.
pl: Odstęp heartbeat O2CB ustawia maksymalny czas w sekundach, jaki węzeł oczekuje na operację wejścia/wyjścia. Po przekroczeniu go, węzeł się "odetnie", co będzie najprawdopodobniej widoczne jako awaria.

source: It is calculated as the result of: (threshold - 1) x 2.
pl: Jest to obliczane w następujący sposób: (odstęp - 1) x 2.

source: Its default value is 31 (60 seconds).
pl: Domyślną wartością jest 31 (60 sekund).

source: Raise it if you have slow disks and/or crashes with kernel messages like:
pl: Proszę zwiększyć tę wartość w przypadku posiadania wolnych dysków i/lub awarii z komunikatami jądra w stylu:

source: O2CB idle timeout:
pl: Czas oczekiwania O2CB:

source: The O2CB idle timeout (expressed in milliseconds) is the time before a network connection is considered dead.
pl: Czas oczekiwania bezczynności O2CB (wyrażany w milisekundach) jest okresem po jakim połączenie sieciowe jest uważane za zerwane.

source: Its default value is 30000 (30 seconds) and the minimum recommended value is 5000 (5 seconds).
pl: Domyślną wartością jest 30000 (30 sekund), a minimalną zalecaną wartością jest 5000 (5 sekund).

source: O2CB keepalive delay:
pl: Zwłoka keepalive O2CB:

source: The O2CB keepalive delay (expressed in milliseconds) is the maximum time before a keepalive packet is sent.
pl: Zwłoka keepalive O2CB (wyrażana w milisekundach) jest maksymalnym czasem, przed wysyłaniem pakietu keepalive.

source: Its default value is 2000 (2 seconds) and the minimum recommended value is 1000 (1 second).
pl: Domyślną wartością jest 2000 (2 sekundy) a minimalną zalecaną wartością jest 1000 (1 sekunda).

source: O2CB reconnect delay:
pl: Zwłoka ponownego połączenia O2CB:

source: The O2CB reconnect delay (expressed in milliseconds) is the minimum time between connection attempts.
pl: Zwłoka ponownego połączenia O2CB (wyrażana w milisekundach) to minimalny czas pomiędzy próbami ponownego połączenia.

source: Its default and recommended minimum value is 2000 (2 seconds).
pl: Domyślną i zalecaną wartością jest 2000 (2 sekundy).
